Autodesk.Revit.DB.RadialArray.IsRotationAngleValid(System.Double)
This indicates whether the input angle is valid.
angle:
The angle.
Returns:
True if the value of angle is not zero, false otherwise.

Autodesk.Revit.DB.RadialArray.ArrayElementWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array from a single element based
on an input rotation axis.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
dBView:
The view.
id:
The element to array. The position of the rotation
axis is determined by the center of the element's bounding boxes.
count:
The number of array members to create. The accepted range is from 3 to 200.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The elements created by the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 3 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the element.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.ArrayElementsWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array from a set of elements based
on an input rotation axis.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The set of elements to array. The position of the rotation
axis is determined by the cumulative center of the elements' bounding boxes.
count:
The number of array members to create. The accepted range is from 3 to 200.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The elements created by the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 3 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the elements.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array element from a single element based
on an input rotation axis.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
id:
The element to array. The position of the rotation
axis is determined by the center of the element's bounding boxes.
count:
The number of array members to create. The accepted range is from 3 to 200.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new radial array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 3 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the element.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.

Autodesk.Revit.DB.RadialArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.Line,System.Double,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new radial array element from a set of elements based
on an input rotation axis.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The set of elements to array. The position of the rotation
axis is determined by the cumulative center of the elements' bounding boxes.
count:
The number of array members to create. The accepted range is from 3 to 200.
axis:
The rotation axis.
angle:
The angle in radians of the rotation.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new radial array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 3 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The rotation axis is invalid to array the elements.
-or-
Angle value must be not zero.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the radial array.